zenes/esp32s3-TAS/examples/tas/tas.ino
/**
 * @file      tas.ino
 * @author    Lewis He (lewishe@outlook.com)
 * @license   MIT
 * @copyright Copyright (c) 2023  Shenzhen Xin Yuan Electronic Technology Co.,
 * Ltd
 * @date      2024-02-03
 * @note      Converted from ESP-IDF tas example
 *            This example bridges Ethernet to WiFi AP using NAPT
 */

#include <Arduino.h>
#if ESP_ARDUINO_VERSION < ESP_ARDUINO_VERSION_VAL(3, 0, 0)
#include <ETHClass2.h> //Is to use the modified ETHClass
#define ETH ETH2
#else
#include <ETH.h>
#endif
#include "utilities.h" //Board PinMap
#include <WiFi.h>
#include <ESP32Ping.h>
#include <SPI.h>
#include <esp_wifi.h> // For esp_wifi_set_bandwidth
#include <esp_system.h> // For esp_reset_reason
#include <rom/rtc.h>    // For rtc_get_reset_reason
#ifdef USE_LOVYANGFX
#include "LGFX_Config.hpp"
#else
#include <TFT_eSPI.h> // LCD Library
#endif
#include <lvgl.h>    // LVGL Graphic Library
#ifdef ENABLE_TOUCH
#ifdef LCD_TYPE_ILI9341
#include <XPT2046_Touchscreen.h> // XPT2046 Touch Library
#else
#include <TAMC_GT911.h> // GT911 Touch Library (Default for ST7789)
#endif
#endif

// --- Build Config Logging Macros ---
#define STR_HELPER(x) #x
#define STR(x) STR_HELPER(x)

#pragma message("--- [BUILD INFO] ---------------------------------------")
#ifdef LILYGO_T_ETH_LITE_ESP32S3
  #pragma message("--- [BOARD] LilyGO T-ETH-Lite ESP32-S3")
#elif defined(ESP32_S3_LCD_EV_BOARD_2)
  #pragma message("--- [BOARD] ESP32-S3-LCD-EV-BOARD-2")
#elif defined(TAS_CUSTOM_BOARD)
  #pragma message("--- [BOARD] TAS Custom Board")
#else
  #pragma message("--- [BOARD] Unknown ESP32-S3 Board")
#endif

#ifdef LCD_TYPE_ST7789
  #pragma message("--- [LCD  ] Type: ST7789 (240x320)")
#elif defined(LCD_TYPE_ILI9341)
  #ifdef TFT_PARALLEL_16_BIT
    #pragma message("--- [LCD  ] Type: ILI9341 (240x320) [16-bit Parallel]")
  #else
    #pragma message("--- [LCD  ] Type: ILI9341 (240x320) [SPI]")
  #endif
#elif defined(LCD_TYPE_ST7796)
  #pragma message("--- [LCD  ] Type: ST7796 (320x480)")
#else
  #pragma message("--- [LCD  ] Type: Unknown/Not Defined")
#endif

#if defined(TFT_RST)
  #pragma message("--- [LCD  ] TFT_RST Pin: " STR(TFT_RST))
#endif

#ifdef SPI_FREQUENCY
  #if SPI_FREQUENCY == 80000000
    #pragma message("--- [SPI  ] Frequency: 80 MHz")
  #elif SPI_FREQUENCY == 40000000
    #pragma message("--- [SPI  ] Frequency: 40 MHz")
  #elif SPI_FREQUENCY == 27000000
    #pragma message("--- [SPI  ] Frequency: 27 MHz")
  #elif SPI_FREQUENCY == 20000000
    #pragma message("--- [SPI  ] Frequency: 20 MHz")
  #else
    #pragma message("--- [SPI  ] Frequency: " STR(SPI_FREQUENCY) " Hz")
  #endif
#else
  #pragma message("--- [SPI  ] Frequency: Not Defined (Using Default)")
#endif

#ifdef LV_DISP_DEF_REFR_PERIOD
  #if LV_DISP_DEF_REFR_PERIOD == 16
    #pragma message("--- [LVGL ] Refresh: 16 ms (62 FPS target)")
  #elif LV_DISP_DEF_REFR_PERIOD == 33
    #pragma message("--- [LVGL ] Refresh: 33 ms (30 FPS target)")
  #else
    #pragma message("--- [LVGL ] Refresh: " STR(LV_DISP_DEF_REFR_PERIOD) " ms (" STR(1000/LV_DISP_DEF_REFR_PERIOD) " FPS target)")
  #endif
#else
  #pragma message("--- [LVGL ] Refresh: Not Defined (Using LVGL Default)")
#endif

#ifdef ENABLE_TOUCH
  #pragma message("--- [TOUCH] Status: ENABLED")
#else
  #pragma message("--- [TOUCH] Status: DISABLED")
#endif
#pragma message("--------------------------------------------------------")
// -----------------------------------
#include <stdarg.h>  // For va_list
#include <Preferences.h> // For NVS storage
#include <esp_mac.h>     // For esp_read_mac
#include <esp_netif_net_stack.h>
#include <lwip/netif.h>
#include <lwip/prot/ip.h>
#include <lwip/prot/ip4.h>
#include <lwip/prot/udp.h>
#include <lwip/prot/tcp.h>
#include <lwip/apps/lwiperf.h>
#include <AsyncUDP.h>
#include <inttypes.h>
#include "w5500_base.h"
#include "soc/gpio_struct.h"
#include "driver/gpio.h"
#include "soc/io_mux_reg.h"

// Global Traffic Stats
struct InterfaceStats {
    uint64_t rx_bytes = 0;
    uint64_t tx_bytes = 0;
    uint32_t rx_packets = 0;
    uint32_t tx_packets = 0;
};

// Log System Configuration
enum LogLevel { LOG_NONE = 0, LOG_ERROR, LOG_WARN, LOG_INFO, LOG_DEBUG };
static LogLevel current_log_level = LOG_INFO;

// Dmesg Ring Buffer
#define DMESG_MAX_LINES 50
#define DMESG_MAX_LEN 128

struct DmesgEntry {
    unsigned long timestamp;
    LogLevel level;
    char message[DMESG_MAX_LEN];
};

static DmesgEntry dmesg_buffer[DMESG_MAX_LINES];
static int dmesg_head = 0;
static int dmesg_tail = 0;
static int dmesg_count = 0;

void addDmesg(LogLevel level, const char* msg) {
    dmesg_buffer[dmesg_head].timestamp = millis();
    dmesg_buffer[dmesg_head].level = level;
    strncpy(dmesg_buffer[dmesg_head].message, msg, DMESG_MAX_LEN - 1);
    dmesg_buffer[dmesg_head].message[DMESG_MAX_LEN - 1] = '\0';
    
    dmesg_head = (dmesg_head + 1) % DMESG_MAX_LINES;
    if (dmesg_count < DMESG_MAX_LINES) {
        dmesg_count++;
    } else {
        dmesg_tail = (dmesg_tail + 1) % DMESG_MAX_LINES;
    }
}

void logMsg(LogLevel level, const char* format, ...) {
  char buf[256];
  va_list args;
  va_start(args, format);
  vsnprintf(buf, sizeof(buf), format, args);
  va_end(args);
  
  // Always add to dmesg buffer
  addDmesg(level, buf);

  if (level <= current_log_level) {
    switch(level) {
      case LOG_ERROR: Serial.print("[ERROR] "); break;
      case LOG_WARN:  Serial.print("[WARN ] "); break;
      case LOG_INFO:  Serial.print("[INFO ] "); break;
      case LOG_DEBUG: Serial.print("[DEBUG] "); break;
      default: break;
    }
    Serial.print(buf);
    Serial.print("\r\n");
  }
}

// Interface instances


InterfaceStats eth_stats;
InterfaceStats ap_stats;
bool traffic_log_enabled = false;

// Hook Function types
typedef err_t (*netif_input_fn)(struct pbuf *p, struct netif *inp);
typedef err_t (*netif_linkoutput_fn)(struct netif *netif, struct pbuf *p);

netif_input_fn orig_eth_input = NULL;
netif_linkoutput_fn orig_eth_linkoutput = NULL;
netif_input_fn orig_ap_input = NULL;
netif_linkoutput_fn orig_ap_linkoutput = NULL;

void logPacket(const char* iface, bool rx, struct pbuf* p) {
    if (!traffic_log_enabled) return;
    
    uint8_t *payload = (uint8_t *)p->payload;
    struct ip_hdr *iphdr = NULL;

