zenes/esp32s3-TAS/examples/tas/tas.ino
    String cmd = inputString;
    String arg = "";
    int spaceIndex = inputString.indexOf(' ');
    if (spaceIndex != -1) {
      cmd = inputString.substring(0, spaceIndex);
      arg = inputString.substring(spaceIndex + 1);
      arg.trim();
    }

    if (cmd.equalsIgnoreCase("help")) {
      Serial.print("\n\rAvailable Commands:\r\n");
      Serial.print("  help            - Show this help\r\n");
      Serial.print("  status          - Show current system status\r\n");
      Serial.print("  dmesg [lines]   - Show system kernel logs (Ring Buffer)\r\n");
      Serial.print("  loglevel <0-4>  - Set log level (0:NONE, 1:ERR, 2:WARN, 3:INFO, 4:DEBUG)\r\n");
      Serial.print("  monitor <on/off>- Toggle periodic status printing\r\n");
      Serial.print("  restart         - Reboot system\r\n");
      Serial.print("  set_ssid <ssid> - Change WiFi AP SSID\r\n");
      Serial.print("  set_pw <pass>   - Change WiFi AP Password\r\n");
#ifdef ENABLE_ETHERNET
      Serial.print("  stats           - Show interface statistics (Bytes/Packets)\r\n");
      Serial.print("  traffic [on/off]- Show NAT sessions (if on, periodically shows speed)\r\n");
#endif
      Serial.print("  ping <host>     - Ping a host (domain or IP)\r\n");
      Serial.print("  ifconfig        - Show network interface configurations\r\n");
      Serial.print("  arp             - Show connected AP clients (MAC/RSSI)\r\n");
#ifdef ENABLE_ETHERNET
      Serial.print("  dhcp            - Show DHCP server leases (IP/MAC mappings)\r\n");
      Serial.print("  iperf <start|stop>- Start/stop TCP iPerf Server (Port 5001)\r\n");
      Serial.print("  udp_iperf <start|stop>- Start/stop UDP Speed Test (Port 5002)\r\n");
      Serial.print("  toe_iperf <start|stop> [-s | -c ip] - Start/stop W5500 TOE Speed Test\r\n");
#endif
      Serial.print("\r\n");
    } 
    else if (cmd.equalsIgnoreCase("status")) {
      Serial.print("\n\r--- System Status ---\r\n");
      Serial.printf("Ethernet: %s (IP: %s)\r\n", eth_connected ? "Connected" : "Disconnected", ETH.localIP().toString().c_str());
      Serial.printf("WiFi AP : %s (SSID: %s)\r\n", ap_started ? "Running" : "Stopped", ap_ssid_custom.c_str());
      Serial.printf("Clients : %d\r\n", WiFi.softAPgetStationNum());
      Serial.printf("Log Lev : %d\r\n", (int)current_log_level);
      Serial.printf("Monitor : %s\r\n", monitor_enabled ? "ON" : "OFF");
      Serial.printf("Uptime  : %lu sec\r\n", millis() / 1000);
      Serial.printf("CPU Freq: %u MHz\r\n", getCpuFrequencyMhz());
      Serial.printf("Flash   : %u MB\r\n", ESP.getFlashChipSize() / (1024 * 1024));
      
      // CPU Temperature (Best effort)
      float temp = temperatureRead();
      if (!isnan(temp)) {
        Serial.printf("CPU Temp: %.1f °C\r\n", temp);
      }
      
      Serial.printf("Free RAM: %u KB (Internal)\r\n", ESP.getFreeHeap() / 1024);
      Serial.printf("Min Free: %u KB (Internal Min)\r\n", ESP.getMinFreeHeap() / 1024);
      if (psramFound()) {
        Serial.printf("PSRAM   : %u / %u KB (Free/Total)\r\n", ESP.getFreePsram() / 1024, ESP.getPsramSize() / 1024);
      } else {
        Serial.print("PSRAM   : Not Found\r\n");
      }
      Serial.print("-----------------------------\r\n\r\n");
    }
    else if (cmd.equalsIgnoreCase("dmesg")) {
      Serial.print("\n\r--- System Logs (dmesg) ---\r\n");
      
      int max_lines = dmesg_count;
      if (arg.length() > 0) {
        int requested = arg.toInt();
        if (requested > 0 && requested < dmesg_count) {
          max_lines = requested;
        }
      }
      
      int count = 0;
      int idx = (dmesg_head - max_lines + DMESG_MAX_LINES) % DMESG_MAX_LINES;
      
      while (count < max_lines) {
        unsigned long ts = dmesg_buffer[idx].timestamp;
        LogLevel lvl = dmesg_buffer[idx].level;
        const char* msg = dmesg_buffer[idx].message;
        
        const char* lvl_str = "";
        switch(lvl) {
          case LOG_ERROR: lvl_str = "[ERROR]"; break;
          case LOG_WARN:  lvl_str = "[WARN ]"; break;
          case LOG_INFO:  lvl_str = "[INFO ]"; break;
          case LOG_DEBUG: lvl_str = "[DEBUG]"; break;
          default: break;
        }
        
        Serial.printf("[%6lu.%03lu] %s %s\r\n", ts / 1000, ts % 1000, lvl_str, msg);
        
        idx = (idx + 1) % DMESG_MAX_LINES;
        count++;
      }
      Serial.print("---------------------------\r\n\r\n");
    }
    else if (cmd.equalsIgnoreCase("monitor")) {
      if (arg.equalsIgnoreCase("on")) {
        monitor_enabled = true;
        Serial.print("Periodic monitoring: ON\r\n");
      } else if (arg.equalsIgnoreCase("off")) {
        monitor_enabled = false;
        Serial.print("Periodic monitoring: OFF\r\n");
      } else if (arg.equalsIgnoreCase("traffic")) {
        monitor_traffic = !monitor_traffic;
        Serial.printf("Traffic monitoring: %s\r\n", monitor_traffic ? "ON" : "OFF");
      } else {
        Serial.print("Usage: monitor <on/off/traffic>\r\n");
      }
    }
    else if (cmd.equalsIgnoreCase("loglevel")) {
      if (arg.length() > 0) {
        int val = arg.toInt();
        if (val >= 0 && val <= 4) {
          current_log_level = (LogLevel)val;
          Serial.printf("Log level changed to %d\r\n", val);
        } else {
          Serial.print("Error: Log level must be between 0 and 4.\r\n");
        }
      } else {
        Serial.printf("Current Log Level: %d\r\n", (int)current_log_level);
      }
    }
    else if (cmd.equalsIgnoreCase("restart")) {
      Serial.print("Restarting system...\r\n");
      delay(500);
      ESP.restart();
    } 
    else if (cmd.equalsIgnoreCase("set_ssid")) {
      if (arg.length() > 0) {
        ap_ssid_custom = arg;
        preferences.begin("wifi-config", false);
        preferences.putString("ssid", ap_ssid_custom);
        preferences.putString("password", ap_pw_custom); // Save both for consistency
        preferences.end();
        Serial.printf("Changing SSID to '%s'. Restarting AP...\r\n", ap_ssid_custom.c_str());
        
        WiFi.softAPdisconnect(false); // Don't turn off WiFi radio, just stop AP
        delay(100);
        WiFi.softAP(ap_ssid_custom.c_str(), ap_pw_custom.c_str(), AP_CHANNEL, 0, AP_MAX_CONN);
        updateLCD();
      } else {
        Serial.print("Error: No SSID provided. Usage: set_ssid <name>\r\n");
      }
    } 
    else if (cmd.equalsIgnoreCase("set_pw")) {
      if (arg.length() >= 8) {
        ap_pw_custom = arg;
        preferences.begin("wifi-config", false);
        preferences.putString("ssid", ap_ssid_custom);   // Save both for consistency
        preferences.putString("password", ap_pw_custom);
        preferences.end();
        Serial.printf("Changing Password to '%s'. Restarting AP...\r\n", ap_pw_custom.c_str());
        
        WiFi.softAPdisconnect(false); // Don't turn off WiFi radio, just stop AP
        delay(100);
        WiFi.softAP(ap_ssid_custom.c_str(), ap_pw_custom.c_str(), AP_CHANNEL, 0, AP_MAX_CONN);
      } else {
        Serial.print("Error: Password must be at least 8 characters. Usage: set_pw <pass>\r\n");
      }
    } 
#ifdef ENABLE_ETHERNET
    else if (cmd.equalsIgnoreCase("stats")) {
      Serial.println("\r\n--- Interface Statistics (Live) ---");
      Serial.printf("Free RAM: %u KB, Min: %u KB\r\n", ESP.getFreeHeap() / 1024, ESP.getMinFreeHeap() / 1024);
      
      Serial.println("[Ethernet]");
      Serial.printf("  RX: %s (%lu pkts)\r\n", formatBytes(eth_stats.rx_bytes).c_str(), eth_stats.rx_packets);
      Serial.printf("  TX: %s (%lu pkts)\r\n", formatBytes(eth_stats.tx_bytes).c_str(), eth_stats.tx_packets);
      
