zenes/esp32s3-TAS/examples/tas/tas.ino
  Serial.println("\n[Note] WiFi AP is running.");
  Serial.println("       Internet access will be available after Ethernet connection.\n");

  // Step 5: Initialize LCD (Dynamically detected)
#ifdef ENABLE_LCD
  lcd_detected = detectLCD();
  if (lcd_detected) {
    Serial.println("\r\n--- LCD Control Pin Configuration ---");
#if defined(TFT_WR)
    Serial.printf("  TFT_WR  : GPIO %d\n", TFT_WR);
#endif
    Serial.printf("  TFT_DC  : GPIO %d\n", TFT_DC);
#if defined(TFT_CS) && TFT_CS >= 0
    Serial.printf("  TFT_CS  : GPIO %d\n", TFT_CS);
#else
    Serial.println("  TFT_CS  : DISABLED (-1)");
#endif
#if defined(TFT_RST) && TFT_RST >= 0
    Serial.printf("  TFT_RST : GPIO %d\n", TFT_RST);
#endif
    Serial.println("-------------------------------------\n");

#if defined(TFT_BL) && TFT_BL >= 0
    pinMode(LCD_BL_PIN, OUTPUT);
    digitalWrite(LCD_BL_PIN, HIGH); // Turn on backlight
#endif
    Serial.println("Done.");

#if defined(TFT_RST) && TFT_RST >= 0
    Serial.printf("Step 5: Resetting LCD (GPIO %d)... ", TFT_RST);
    pinMode(TFT_RST, OUTPUT);
    digitalWrite(TFT_RST, LOW);
    delay(100);
    digitalWrite(TFT_RST, HIGH);
    delay(150);
    Serial.println("Done.");
#endif

    /* Initialize LCD DMA */
    tft.init();

#ifdef USE_LOVYANGFX
    Serial.printf("  [DIAG] LCD Panel ID: 0x%08X\n", (uint32_t)tft.readData32());
#else
    // TFT_eSPI: readID() 미지원 버전의 경우 readcommand8(0x04)로 대체
    Serial.printf("  [DIAG] LCD Panel ID: 0x%02X\n", (uint32_t)tft.readcommand8(0x04));
#endif

#ifdef ENABLE_TE_SYNC
    // ... (TE_SYNC 블록)
#else
    // Fast Mode: TE 미사용 및 패널 하드웨어 기본값(보통 60Hz) 그대로 작동하도록 방치
    Serial.println("ST7789 TE Sync Disabled (Fast Mode - Default Hardware Refresh Rate)");
    
#ifndef USE_LOVYANGFX
    tft.initDMA(); // Start GDMA for SPI
#endif
#endif

    /* Initialize LVGL and Allocate DMA Buffers in Internal SRAM */
    lv_init();
    
    // Landscape 모드: hor_res = LCD_HEIGHT = 320 → 행 너비 = 320
    // 64 lines: 320*64*2 = 40KB per buffer (DMA 캐시 효율 최적)
    size_t lines = 64;
    size_t buf_size = LCD_HEIGHT * lines * sizeof(lv_color_t); // ← LCD_HEIGHT(320) 사용
    
    buf1 = (lv_color_t *)heap_caps_malloc(buf_size, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    buf2 = (lv_color_t *)heap_caps_malloc(buf_size, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    
    if (buf1 == NULL || buf2 == NULL) {
        Serial.println("Failed to allocate DMA buffers! Falling back to SRAM Single...");
        if(buf1) free(buf1);
        static lv_color_t sram_single[LCD_HEIGHT * 20]; // ← LCD_HEIGHT(320) 사용
        lv_disp_draw_buf_init(&draw_buf, sram_single, NULL, LCD_HEIGHT * 20);
    } else {
        Serial.printf("DMA Double Buffers allocated: 2 x %u bytes\n", buf_size);
        lv_disp_draw_buf_init(&draw_buf, buf1, buf2, LCD_HEIGHT * lines); // ← LCD_HEIGHT(320) 사용
    }


    /* Initialize the display driver for LVGL */
    static lv_disp_drv_t disp_drv;
    lv_disp_drv_init(&disp_drv);
    disp_drv.hor_res = LCD_HEIGHT; // Landscape
    disp_drv.ver_res = LCD_WIDTH;  // Landscape
    disp_drv.flush_cb = my_disp_flush;
    disp_drv.monitor_cb = my_monitor_cb; // 추가: 렌더링 성능 모니터링 연결
    disp_drv.draw_buf = &draw_buf; // CRITICAL: This was missing!
    
    // 강제 전체 업데이트 해제 (부분 업데이트로 복귀하여 프레임레이트 복구)
    disp_drv.full_refresh = 1; 

    lv_disp_t * disp_obj = lv_disp_drv_register(&disp_drv);
    
    /* Initialize and Register Touchpad */
#ifdef ENABLE_TOUCH
#ifdef LCD_TYPE_ILI9341
    tp.begin();
    tp.setRotation(1); // Landscape for XPT2046
#elif defined(TOUCH_SDA) && defined(TOUCH_SCL)
    tp.begin();
    tp.setRotation(ROTATION_RIGHT);
#endif

    static lv_indev_drv_t indev_drv;
    lv_indev_drv_init(&indev_drv);
    indev_drv.type = LV_INDEV_TYPE_POINTER;
    indev_drv.read_cb = my_touchpad_read;
    lv_indev_drv_register(&indev_drv);

    /* Create a touch indicator on System Layer (Always on top) */
    touch_cursor = lv_obj_create(lv_layer_sys());
    lv_obj_set_size(touch_cursor, 10, 10);
    lv_obj_set_style_bg_color(touch_cursor, lv_palette_main(LV_PALETTE_RED), 0);
    lv_obj_set_style_radius(touch_cursor, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_border_width(touch_cursor, 0, 0);
    lv_obj_add_flag(touch_cursor, LV_OBJ_FLAG_HIDDEN);
    lv_obj_set_style_bg_opa(touch_cursor, LV_OPA_70, 0);

    // Horizontal crosshair
    touch_line_h = lv_obj_create(lv_layer_sys());
    lv_obj_set_size(touch_line_h, LCD_HEIGHT, 2); // Thicker (2px)
    lv_obj_set_style_bg_color(touch_line_h, lv_palette_main(LV_PALETTE_LIME), 0);
    lv_obj_add_flag(touch_line_h, LV_OBJ_FLAG_HIDDEN);

    // Vertical crosshair
    touch_line_v = lv_obj_create(lv_layer_sys());
    lv_obj_set_size(touch_line_v, 2, LCD_WIDTH); // Thicker (2px)
    lv_obj_set_style_bg_color(touch_line_v, lv_palette_main(LV_PALETTE_LIME), 0);
    lv_obj_add_flag(touch_line_v, LV_OBJ_FLAG_HIDDEN);

    // Coordinate label
    touch_label = lv_label_create(lv_layer_sys());
    lv_obj_set_style_text_color(touch_label, lv_palette_main(LV_PALETTE_LIME), 0);
    lv_obj_set_style_bg_color(touch_label, lv_palette_main(LV_PALETTE_GREY), 0);
    lv_obj_set_style_bg_opa(touch_label, LV_OPA_50, 0);
    lv_obj_add_flag(touch_label, LV_OBJ_FLAG_HIDDEN);
#endif

#ifdef ENABLE_TE_SYNC
    // Set refresh period to 16ms for 60 FPS (하드웨어 60Hz와 동기화)
    lv_timer_t * refr_timer = _lv_disp_get_refr_timer(disp_obj);
    if (refr_timer) lv_timer_set_period(refr_timer, LV_DISP_DEF_REFR_PERIOD);
#else
    // Set refresh period to 16ms for 60 FPS (최대 성능)
    lv_timer_t * refr_timer = _lv_disp_get_refr_timer(disp_obj);
    if (refr_timer) lv_timer_set_period(refr_timer, LV_DISP_DEF_REFR_PERIOD);
#endif

    lcd_initialized = true; 
    Serial.println("Done.");

    Serial.print("Step 7: LVGL UI creation... ");
    tft.setRotation(1); // Landscape
    initLVGLUI();
    updateLCD();
    Serial.println("Done.");
  } else {
    Serial.println("Step 5-7: LCD Hardware not found. Skipping.");
  }
#else
  Serial.println("Step 5-7: LCD Feature Disabled.");
#endif

